system/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    	(0 0 0)            	// vertex #0
    	(0 4 0)          	// vertex #1
 	(1 4 0)   		// vertex #2
        (1 0 0)         	// vertex #3
        (0 0 -0.1)	   	// vertex #4
 	(0 4 -0.1)	 	// vertex #5
	(1 4 -0.1) 		// vertex #6
	(1 0 -0.1)	        // vertex #7
);

blocks          
(
        hex (0 1 2 3 4 5 6 7) (500 100 1) simpleGrading (1 1 1)
);

edges           
(
);

boundary
(
    leftWall
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    rightWall
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    
    topWall 
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    bottomWall
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    backAndFront
    {
        type empty;
	faces
	(
	    (0 3 2 1)
	    (4 5 6 7)
	);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
