Allrun
#!/bin/sh
blockMesh

decomposePar

mpirun -np 4 interFoam -parallel
#------------------------------------------------------------------------------
